arduino/Arduino/hardware/lm4f/variants/launchpad_129/pins_energia.h
const uint8_t timer_to_ab[] = {
    TIMA,
    TIMA,
    TIMB,
    TIMB,
    TIMA,
    TIMA,
    TIMB,
    TIMB,
    TIMA,
    TIMA,
    TIMB,
    TIMA,
    TIMB,
    TIMA,
    TIMB,
    TIMA,
    TIMB,
    TIMA,
    TIMB,
    TIMA,
    TIMB,
    TIMA,
    TIMB,
};
const uint32_t timer_to_pin_config[] = {
/*
	GPIO_PB6_T0CCP0,
	GPIO_PF0_T0CCP0,
	GPIO_PB7_T0CCP1,
	GPIO_PF1_T0CCP1,
	GPIO_PB4_T1CCP0,
	GPIO_PF2_T1CCP0,
	GPIO_PB5_T1CCP1,
	GPIO_PF3_T1CCP1,
	GPIO_PB0_T2CCP0,
	GPIO_PF4_T2CCP0,
	GPIO_PB1_T2CCP1,
	GPIO_PB2_T3CCP0,
	GPIO_PB3_T3CCP1,
	GPIO_PC4_WT0CCP0,
	GPIO_PC5_WT0CCP1,
	GPIO_PC6_WT1CCP0,
	GPIO_PC7_WT1CCP1,
	GPIO_PD0_WT2CCP0,
	GPIO_PD1_WT2CCP1,
	GPIO_PD2_WT3CCP0,
	GPIO_PD3_WT3CCP1,
	GPIO_PD6_WT5CCP0,
	GPIO_PD7_WT5CCP1,
*/
};

const uint8_t digital_pin_to_timer[]      = {
    NOT_ON_TIMER,   // dummy 
    NOT_ON_TIMER,   // 01 - 3.3v       X8_01   // TODO: CH will fix these
    NOT_ON_TIMER,   // 02 - PE_4       X8_03
    NOT_ON_TIMER,   // 03 - PC_4       X8_05
    NOT_ON_TIMER,   // 04 - PC_5       X8_07
    NOT_ON_TIMER,   // 05 - PC_6       X8_09
    NOT_ON_TIMER,   // 06 - PE_5       X8_11
    NOT_ON_TIMER,   // 07 - PD_3       X8_13
    NOT_ON_TIMER,   // 08 - PC_7       X8_15
    NOT_ON_TIMER,   // 09 - PB_2       X8_17
    NOT_ON_TIMER,   // 10 - PB_3       X8_19
    NOT_ON_TIMER,   // 11 - PP_2       X9_20
    NOT_ON_TIMER,   // 12 - PN_3       X9_18
    NOT_ON_TIMER,   // 13 - PN_2       X9_16
    NOT_ON_TIMER,   // 14 - PD_0       X9_14
    NOT_ON_TIMER,   // 15 - PD_1       X9_12
    NOT_ON_TIMER,   // 16 - RST        X9_10
    NOT_ON_TIMER,   // 17 - PH_3       X9_08
    NOT_ON_TIMER,   // 18 - PH_2       X9_06
    NOT_ON_TIMER,   // 19 - PM_3       X9_04
    NOT_ON_TIMER,   // 20 - GND        X9_02
    NOT_ON_TIMER,   // 21 - 5v         X8_02
    NOT_ON_TIMER,   // 22 - GND        X8_04
    NOT_ON_TIMER,   // 23 - PE_0       X8_06
    NOT_ON_TIMER,   // 24 - PE_1       X8_08
    NOT_ON_TIMER,   // 25 - PE_2       X8_10
    NOT_ON_TIMER,   // 26 - PE_3       X8_12
    NOT_ON_TIMER,   // 27 - PD_7       X8_14
    NOT_ON_TIMER,   // 28 - PA_6       X8_16
    NOT_ON_TIMER,   // 29 - PM_4       X8_18
    NOT_ON_TIMER,   // 30 - PM_5       X8_20
    NOT_ON_TIMER,   // 31 - PL_3       X9_19
    NOT_ON_TIMER,   // 32 - PL_2       X9_17
    NOT_ON_TIMER,   // 33 - PL_1       X9_15
    NOT_ON_TIMER,   // 34 - PL_0       X9_13
    NOT_ON_TIMER,   // 35 - PL_5       X9_11
    NOT_ON_TIMER,   // 36 - PL_4       X9_09
    NOT_ON_TIMER,   // 37 - PG_0       X9_07
    NOT_ON_TIMER,   // 38 - PF_3       X9_05
    NOT_ON_TIMER,   // 39 - PF_2       X9_03
    NOT_ON_TIMER,   // 40 - PF_1       X9_01
    NOT_ON_TIMER,   // 41 - 3.3v       X6_01
    NOT_ON_TIMER,   // 42 - PD_2       X6_03
    NOT_ON_TIMER,   // 43 - PP_0       X6_05
    NOT_ON_TIMER,   // 44 - PP_1       X6_07
    NOT_ON_TIMER,   // 45 - PD_4       X6_09
    NOT_ON_TIMER,   // 46 - PD_5       X6_11
    NOT_ON_TIMER,   // 47 - PQ_0       X6_13
    NOT_ON_TIMER,   // 48 - PP_4       X6_15
    NOT_ON_TIMER,   // 49 - PN_5       X6_17
    NOT_ON_TIMER,   // 50 - PN_4       X6_19
    NOT_ON_TIMER,   // 51 - PM_6       X7_20
    NOT_ON_TIMER,   // 52 - PQ_1       X7_18
    NOT_ON_TIMER,   // 53 - PP_3       X7_16
    NOT_ON_TIMER,   // 54 - PQ_3       X7_14
    NOT_ON_TIMER,   // 55 - PQ_2       X7_12
    NOT_ON_TIMER,   // 56 - RESET      X7_10
    NOT_ON_TIMER,   // 57 - PA_7       X7_08
    NOT_ON_TIMER,   // 58 - PP_5       X7_06
    NOT_ON_TIMER,   // 59 - PM_7       X7_04
    NOT_ON_TIMER,   // 60 - GND        X7_02
    NOT_ON_TIMER,   // 61 - 5v         X6_02
    NOT_ON_TIMER,   // 62 - GND        X6_04
    NOT_ON_TIMER,   // 63 - PB_4       X6_06
    NOT_ON_TIMER,   // 64 - PB_5       X6_08
    NOT_ON_TIMER,   // 65 - PK_0       X6_10
    NOT_ON_TIMER,   // 66 - PK_1       X6_12
    NOT_ON_TIMER,   // 67 - PK_2       X6_14
    NOT_ON_TIMER,   // 68 - PK_3       X6_16
    NOT_ON_TIMER,   // 69 - PA_4       X6_18
    NOT_ON_TIMER,   // 70 - PA_5       X6_20
    NOT_ON_TIMER,   // 71 - PK_7       X7_19
    NOT_ON_TIMER,   // 72 - PK_6       X7_17
    NOT_ON_TIMER,   // 73 - PH_1       X7_15
    NOT_ON_TIMER,   // 74 - PH_0       X7_13
    NOT_ON_TIMER,   // 75 - PM_2       X7_11
    NOT_ON_TIMER,   // 76 - PM_1       X7_09
    NOT_ON_TIMER,   // 77 - PM_0       X7_07
    NOT_ON_TIMER,   // 78 - PK_5       X7_05
    NOT_ON_TIMER,   // 79 - PK_4       X7_03
    NOT_ON_TIMER,   // 80 - PG_1       X7_01
    NOT_ON_TIMER,   // 81 - PN_1       LED1
    NOT_ON_TIMER,   // 82 - PN_0       LED2
    NOT_ON_TIMER,   // 83 - PF_4       LED3
    NOT_ON_TIMER,   // 84 - PF_0       LED4
    NOT_ON_TIMER,   // 85 - PJ_0       USR_SW1
    NOT_ON_TIMER,   // 86 - PJ_1       USR_SW2
    NOT_ON_TIMER,   // 87 - PD_6       AIN5
    NOT_ON_TIMER,   // 88 - PA_0       JP4
    NOT_ON_TIMER,   // 89 - PA_1       JP5
};


const uint8_t digital_pin_to_port[]       = {
    NOT_A_PIN,      // dummy 
    NOT_A_PIN,      // 01 - 3.3v       X8_01
    PE,             // 02 - PE_4       X8_03
    PC,             // 03 - PC_4       X8_05
    PC,             // 04 - PC_5       X8_07
    PC,             // 05 - PC_6       X8_09
    PE,             // 06 - PE_5       X8_11
    PD,             // 07 - PD_3       X8_13
    PC,             // 08 - PC_7       X8_15
    PB,             // 09 - PB_2       X8_17
    PB,             // 10 - PB_3       X8_19
    PP,             // 11 - PP_2       X9_20
    PN,             // 12 - PN_3       X9_18
    PN,             // 13 - PN_2       X9_16
    PD,             // 14 - PD_0       X9_14
    PD,             // 15 - PD_1       X9_12
    NOT_A_PIN,      // 16 - RST        X9_10
    PH,             // 17 - PH_3       X9_08
    PH,             // 18 - PH_2       X9_06
    PM,             // 19 - PM_3       X9_04
    NOT_A_PIN,      // 20 - GND        X9_02
    NOT_A_PIN,      // 21 - 5v         X8_02
    NOT_A_PIN,      // 22 - GND        X8_04
    PE,             // 23 - PE_0       X8_06
    PE,             // 24 - PE_1       X8_08
    PE,             // 25 - PE_2       X8_10
    PE,             // 26 - PE_3       X8_12
    PD,             // 27 - PD_7       X8_14
    PA,             // 28 - PA_6       X8_16
    PM,             // 29 - PM_4       X8_18
    PM,             // 30 - PM_5       X8_20
    PL,             // 31 - PL_3       X9_19
    PL,             // 32 - PL_2       X9_17
    PL,             // 33 - PL_1       X9_15
    PL,             // 34 - PL_0       X9_13
    PL,             // 35 - PL_5       X9_11
    PL,             // 36 - PL_4       X9_09
    PG,             // 37 - PG_0       X9_07
    PF,             // 38 - PF_3       X9_05
    PF,             // 39 - PF_2       X9_03
    PF,             // 40 - PF_1       X9_01
    NOT_A_PIN,      // 41 - 3.3v       X6_01
    PD,             // 42 - PD_2       X6_03
    PP,             // 43 - PP_0       X6_05
    PP,             // 44 - PP_1       X6_07
    PD,             // 45 - PD_4       X6_09
    PD,             // 46 - PD_5       X6_11
    PQ,             // 47 - PQ_0       X6_13
    PP,             // 48 - PP_4       X6_15
    PN,             // 49 - PN_5       X6_17
    PN,             // 50 - PN_4       X6_19
    PM,             // 51 - PM_6       X7_20
    PQ,             // 52 - PQ_1       X7_18
    PP,             // 53 - PP_3       X7_16
    PQ,             // 54 - PQ_3       X7_14
    PQ,             // 55 - PQ_2       X7_12
    NOT_A_PIN,      // 56 - RESET      X7_10
    PA,             // 57 - PA_7       X7_08
    PP,             // 58 - PP_5       X7_06
    PM,             // 59 - PM_7       X7_04
    NOT_A_PIN,      // 60 - GND        X7_02
    NOT_A_PIN,      // 61 - 5v         X6_02
    NOT_A_PIN,      // 62 - GND        X6_04
    PB,             // 63 - PB_4       X6_06
    PB,             // 64 - PB_5       X6_08
    PK,             // 65 - PK_0       X6_10
    PK,             // 66 - PK_1       X6_12
    PK,             // 67 - PK_2       X6_14
    PK,             // 68 - PK_3       X6_16
    PA,             // 69 - PA_4       X6_18
    PA,             // 70 - PA_5       X6_20
    PK,             // 71 - PK_7       X7_19
    PK,             // 72 - PK_6       X7_17
    PH,             // 73 - PH_1       X7_15
    PH,             // 74 - PH_0       X7_13
    PM,             // 75 - PM_2       X7_11
    PM,             // 76 - PM_1       X7_09
    PM,             // 77 - PM_0       X7_07
    PK,             // 78 - PK_5       X7_05
    PK,             // 79 - PK_4       X7_03
    PG,             // 80 - PG_1       X7_01
    PN,             // 81 - PN_1       LED1
    PN,             // 82 - PN_0       LED2
    PF,             // 83 - PF_4       LED3
    PF,             // 84 - PF_0       LED4
    PJ,             // 85 - PJ_0       USR_SW1
    PJ,             // 86 - PJ_1       USR_SW2
    PD,             // 87 - PD_6       AIN5
    PA,             // 88 - PA_0       JP4
    PA,             // 89 - PA_1       JP5
};


